In [49]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [50]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [51]:
a = pd.Series(data=my_data)
b = pd.Series(data=labels)
pd.concat([a, b], axis=1).reset_index()

   index   0  1
0      0  10  a
1      1  20  b
2      2  30  c

In [52]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [53]:
# Can call data with labels as index
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [54]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [55]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [56]:
d

{'a': 10, 'b': 20, 'c': 30}

In [57]:
np.array(object=[sum, print, len])

array([<built-in function sum>, <built-in function print>,
       <built-in function len>], dtype=object)

In [58]:
# Np array not using labels
np.array(d)

array({'a': 10, 'b': 20, 'c': 30}, dtype=object)

In [59]:
# dType is for data type. not labels 
ser1 = pd.Series(data=[1, 2, 3, 4], index=['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [60]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [61]:
ser1['USA']

1

In [62]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [63]:
num = np.random.seed(101)

In [64]:
# Series data yang berbagi index
df = pd.DataFrame(data=randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
randn(2, 3)

array([[ 0.30266545,  1.69372293, -1.70608593],
       [-1.15911942, -0.13484072,  0.39052784]])

In [66]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [67]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [68]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [69]:
# Drop column, not inplace
df.drop('new', axis=1, inplace=True)

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [72]:
df.shape

(5, 4)

In [73]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
# grab row, using string, label based
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [75]:
df.iloc['A']

TypeError: Cannot index by location index with a non-integer key

In [ ]:
# index based location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df.loc['A','Y']

0.9079694464765431

In [ ]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [ ]:
# Conditional selection
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [ ]:
# Not common
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['W'] > 0][['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [ ]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [ ]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop('index', axis=1)

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [ ]:
newindex = 'CA NY WY OR CO'.split()

In [ ]:
type(newindex)

list

In [ ]:
df['state'] = newindex

In [ ]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [ ]:
df.set_index('state')

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [ ]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
# Multilevel index
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B']) 
df

             A         B
G1 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366
G2 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259

In [ ]:
df.loc['G1']['A']

1    0.238127
2   -0.993263
3   -1.136645
Name: A, dtype: float64

In [ ]:
df.index.names = ['Groups', 'Num']

In [ ]:
df

                   A         B
Groups Num
G1     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366
G2     1    1.025984 -0.156598
       2   -0.031579  0.649826
       3    2.154846 -0.610259

In [ ]:
df.xs('G1') # Same as df.loc['G1']

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [ ]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.238127  1.996652
G2      1.025984 -0.156598

In [ ]:
np.random.seed(101)
df = pd.DataFrame(randn(6, 6), columns=['A', 'B', 'C', 'D', 'E', 'F'], index=['Group_A', 'Group_B', 'Group_C', 'Group_D', 'Group_E', 'Group_F'])
df = df[df > 0]

In [ ]:
df = df.drop(['F'], axis=1)

In [ ]:
df

                A         B         C         D         E
Group_A  2.706850  0.628133  0.907969  0.503826  0.651118
Group_B       NaN  0.605965       NaN  0.740122  0.528813
Group_C  0.188695       NaN       NaN  0.955057  0.190794
Group_D  2.605967  0.683509  0.302665  1.693723       NaN
Group_E       NaN  0.390528  0.166905  0.184502  0.807706
Group_F  0.638787  0.329646       NaN       NaN       NaN

In [ ]:
df.dropna()

               A         B         C         D         E
Group_A  2.70685  0.628133  0.907969  0.503826  0.651118

In [ ]:
# Atleast 4 non-null values
df.dropna(thresh=4)

                A         B         C         D         E
Group_A  2.706850  0.628133  0.907969  0.503826  0.651118
Group_D  2.605967  0.683509  0.302665  1.693723       NaN
Group_E       NaN  0.390528  0.166905  0.184502  0.807706

In [ ]:
df['A'].fillna(value=df['A'].mean())

Group_A    2.706850
Group_B    1.535075
Group_C    0.188695
Group_D    2.605967
Group_E    1.535075
Group_F    0.638787
Name: A, dtype: float64

In [ ]:
df['A'].median()

1.622377146645304

In [ ]:
data = {'Company': ['Google', 'Google', 'Google', 'Apple', 'Apple', 'Apple'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Mary', 'Steve'],
        'Sales': [200, 120, 340, 124, 243, 350]}

In [ ]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0  Google      Sam    200
1  Google  Charlie    120
2  Google      Amy    340
3   Apple  Vanessa    124
4   Apple     Mary    243
5   Apple    Steve    350

In [ ]:
byComp = df.groupby('Company')

In [ ]:
byComp.sum()

         Sales
Company
Apple      717
Google     660

In [ ]:
df.groupby('Company').sum().loc['Google']

Sales    660
Name: Google, dtype: int64

In [ ]:
df.groupby('Company').max()

          Person  Sales
Company
Apple    Vanessa    350
Google       Sam    340

In [ ]:
df.groupby('Company').describe().transpose()

Company           Apple      Google
Sales count    3.000000    3.000000
      mean   239.000000  220.000000
      std    113.053085  111.355287
      min    124.000000  120.000000
      25%    183.500000  160.000000
      50%    243.000000  200.000000
      75%    296.500000  270.000000
      max    350.000000  340.000000

In [ ]:
# merging, joining, concat
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df1, df2, df3], axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
df.fillna(df['W'].mean())

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [ ]:
pd.merge(left, right, how='outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
left.join(right)

In [ ]:
a = pd.concat([left, right], axis=1)
a

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
# number of unique values
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df[df['col1'] == 2]

   col1  col2 col3
1     2   555  def

In [ ]:
def times2(x):
  return x ** 2

In [ ]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [ ]:
df['col2'].apply(lambda x : x ** 2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [ ]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [ ]:
df.isnull().value_counts()

col1   col2   col3
False  False  False    4
dtype: int64

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [ ]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
# Convert into multilevel index
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [ ]:
# Data input and output
# CSV, Excel, HTML, JSON, SQL, XML

In [ ]:
# CSV
df = pd.read_csv('https://raw.githubusercontent.com/raihanromzi/Python.Classification_ML/main/Datasets/kendaraan_train.csv')

In [ ]:
df

,id,Jenis_Kelamin,Umur,SIM,Kode_Daerah,Sudah_Asuransi,Umur_Kendaraan,Kendaraan_Rusak,Premi,Kanal_Penjualan,Lama_Berlangganan,Tertarik
0,1,Wanita,30.0,1.0,33.0,1.0,< 1 Tahun,Tidak,28029.0,152.0,97.0,0
1,2,Pria,48.0,1.0,39.0,0.0,> 2 Tahun,Pernah,25800.0,29.0,158.0,0
2,3,NaN,21.0,1.0,46.0,1.0,< 1 Tahun,Tidak,32733.0,160.0,119.0,0
3,4,Wanita,58.0,1.0,48.0,0.0,1-2 Tahun,Tidak,2630.0,124.0,63.0,0
4,5,Pria,50.0,1.0,35.0,0.0,> 2 Tahun,NaN,34857.0,88.0,194.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
285826,285827,Wanita,23.0,1.0,4.0,1.0,< 1 Tahun,Tidak,25988.0,152.0,217.0,0
285827,285828,Wanita,21.0,1.0,46.0,1.0,< 1 Tahun,Tidak,44686.0,152.0,50.0,0
285828,285829,Wanita,23.0,1.0,50.0,1.0,< 1 Tahun,Tidak,49751.0,152.0,226.0,0
285829,285830,Pria,68.0,1.0,7.0,1.0,1-2 Tahun,Tidak,30503.0,124.0,270.0,0
285830,285831,Pria,45.0,1.0,28.0,0.0,1-2 Tahun,Pernah,36480.0,26.0,44.0,0

In [ ]:
# Any file
df.to_csv('file_example.csv', index=False)

In [ ]:
df = pd.read_csv('file_example.csv')
df

,id,Jenis_Kelamin,Umur,SIM,Kode_Daerah,Sudah_Asuransi,Umur_Kendaraan,Kendaraan_Rusak,Premi,Kanal_Penjualan,Lama_Berlangganan,Tertarik
0,1,Wanita,30.0,1.0,33.0,1.0,< 1 Tahun,Tidak,28029.0,152.0,97.0,0
1,2,Pria,48.0,1.0,39.0,0.0,> 2 Tahun,Pernah,25800.0,29.0,158.0,0
2,3,NaN,21.0,1.0,46.0,1.0,< 1 Tahun,Tidak,32733.0,160.0,119.0,0
3,4,Wanita,58.0,1.0,48.0,0.0,1-2 Tahun,Tidak,2630.0,124.0,63.0,0
4,5,Pria,50.0,1.0,35.0,0.0,> 2 Tahun,NaN,34857.0,88.0,194.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
285826,285827,Wanita,23.0,1.0,4.0,1.0,< 1 Tahun,Tidak,25988.0,152.0,217.0,0
285827,285828,Wanita,21.0,1.0,46.0,1.0,< 1 Tahun,Tidak,44686.0,152.0,50.0,0
285828,285829,Wanita,23.0,1.0,50.0,1.0,< 1 Tahun,Tidak,49751.0,152.0,226.0,0
285829,285830,Pria,68.0,1.0,7.0,1.0,1-2 Tahun,Tidak,30503.0,124.0,270.0,0
285830,285831,Pria,45.0,1.0,28.0,0.0,1-2 Tahun,Pernah,36480.0,26.0,44.0,0

In [78]:
# Excel
excel = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [84]:
excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [80]:
excel.drop(['Unnamed: 0'], axis=1, inplace=True)

In [82]:
excel.to_excel('Excel_Sample_Output.xlsx', index=False, sheet_name='Sheet2')

In [85]:
# SQL
from sqlalchemy import create_engine

In [86]:
engine = create_engine('sqlite:///:memory:')

In [95]:
excel.to_sql('table2', con=engine, index=False)

4

In [96]:
sqldf = pd.read_sql('table2', con=engine)

In [97]:
sqldf

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15